Revit 2026 API

# SolidGlassSolidglassColorByObject Property

---

The property labeled "Custom Color" from the "SolidGlass" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string SolidglassColorByObject { get; }
```
```vb
Public Shared ReadOnly Property SolidglassColorByObject As String
	Get
```
```cpp
public:
static property String^ SolidglassColorByObject {
	String^ get ();
}
```
```fsharp
static member SolidglassColorByObject : string with get
```

#### Property Value

String

This property is of type "AssetPropertyBoolean".

#### Reference

SolidGlass Class

Autodesk.Revit.DB.Visual Namespace